Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Finally, the last line makes ``Foo`` a virtual subclass of ``MyIterable``, even though it does not define an :meth:`__iter__` method (it uses the old-style iterable protocol, defined in terms of :meth:`__len__` and :meth:`__getitem__`). Note that this will not make ``get_iterator`` available as a method of ``Foo``, so it is provided separately.
pl: Ostatecznie, ostatnia linia czyni ``Foo`` wirtualnym podrzędnym uogólnieniem względem ``MyIterable``, nawet jeśli nie definiuje ono sposobu postępowania :meth:`__iter__` (używa ono protokołu iterowalności w-starym-stylu, zdefiniowanej w ramach :meth:`__len__` i :meth:`__getitem__`). Zauważ, że to nie uczyni sposobu postępowania ``get_iterator`` dostępnym jako sposobu postępowania należącego do ``Foo``, więc jest on dostarczony oddzielnie.

source: It also provides the following decorators:
pl: Dostarcza także następujące dekoratory:

source: A decorator indicating abstract methods.
pl: Dekorator wskazujący abstrakcyjne sposoby postępowania.

source: Using this decorator requires that the class's metaclass is :class:`ABCMeta` or is derived from it. A class that has a metaclass derived from :class:`ABCMeta` cannot be instantiated unless all of its abstract methods and properties are overridden. The abstract methods can be called using any of the normal 'super' call mechanisms.
pl: Użycie tego dekoratora wymaga, żeby pośrednim uogólnieniem (metaclass) tego uogólnienia było :class:`ABCMeta` lub było po nim odziedziczone. Dla uogólnienia którego pośrednie uogólnienie odziedziczone jest po :class:`ABCMeta` nie można dać przykładu, chyba że wszystkie jego sposoby postępowania abstrakcyjne i właściwości zostaną przesłonięte. Abstrakcyjne sposoby postępowania mogą być wywołane przy użyciu dowolnego ze zwykłych mechanizmów odwołań 'super'.

source: Dynamically adding abstract methods to a class, or attempting to modify the abstraction status of a method or class once it is created, are not supported. The :func:`abstractmethod` only affects subclasses derived using regular inheritance; "virtual subclasses" registered with the ABC's :meth:`register` method are not affected.
pl: Dynamiczne dodawanie abstrakcyjnych sposobów postępowania do uogólnienia, lub próbowanie modyfikacji statusu abstrakcji sposobu postępowania lub uogólnienia gdy już zostanie utworzone nie jest wspierane. Zadanie :func:`abstractmethod` dotyczy tylko podrzędnych uogólnień odziedziczonych przy użyciu zwykłego dziedziczenia; "sztucznego podrzędnego uogólnienia" ( - z ang. - "virtual subclasses") zarejestrowanego za pomocą sposobu postępowania :meth:`register` należącego do abstrakcyjnego uogólnienia podstawowego ten sposób postępowania nie dotyczy.

source: Usage::
pl: Użycie::

source: Unlike Java abstract methods, these abstract methods may have an implementation. This implementation can be called via the :func:`super` mechanism from the class that overrides it. This could be useful as an end-point for a super-call in a framework that uses cooperative multiple-inheritance.
pl: W przeciwieństwie do abstrakcyjnych sposobów postępowania Javy, te abstrakcyjne sposoby postępowania mogą mieć swoje wypełnienie. To wypełnienie może być wzywane przez mechanizm odwołań do zadania :func:`super`, z uogólnienia które przesłania taki sposób postępowania. To może być użyteczne jako punkt końcowy super-wywołania w ramach udogodnienia które używa współpracującego wielokrotnego-dziedziczenia.

source: A subclass of the built-in :func:`property`, indicating an abstract property.
pl: Podrzędne uogólnienie wbudowanego zadania :func:`property` wskazujące abstrakcyjną właściwość.

source: Using this function requires that the class's metaclass is :class:`ABCMeta` or is derived from it. A class that has a metaclass derived from :class:`ABCMeta` cannot be instantiated unless all of its abstract methods and properties are overridden. The abstract properties can be called using any of the normal 'super' call mechanisms.
pl: Używanie tego zadania wymaga aby pośrednie-uogólnienie uogólnienia było :class:`ABCMeta` lub pochodne po nim. Nie można dawać przykładu uogólnienia którego uogólnienie-pośrednie pochodne jest po :class:`ABCMeta`, chyba, że jego wszystkie abstrakcyjne sposoby postępowania i właściwości zostaną przesłonięte. Abstrakcyjne właściwości mogą być wzywane przy użyciu dowolnego ze zwykłych mechanizmów wywołań 'super'.

source: This defines a read-only property; you can also define a read-write abstract property using the 'long' form of property declaration::
pl: To definiuje właściwość tylko-do-odczytu; możesz też zdefiniować wczytywaną-zapisywaną abstrakcyjną właściwość używając 'długiej' formy deklaracji właściwości::

source: Footnotes
pl: Przypisy

source: C++ programmers should note that Python's virtual base class concept is not the same as C++'s.
pl: Programiści C++ powinni zauważyć, że koncepcja wirtualnego uogólnienia podstawowego z języka pytonowskiego nie jest tożsame z tym z C++'a.

source: :mod:`aifc` --- Read and write AIFF and AIFC files
pl: Moduł :mod:`aifc` --- Wczytaj i zapisz pliki AIFF i AIFC

source: This module provides support for reading and writing AIFF and AIFF-C files. AIFF is Audio Interchange File Format, a format for storing digital audio samples in a file. AIFF-C is a newer version of the format that includes the ability to compress the audio data.
pl: Ten moduł dostarcza wsparcie dla wczytywania i zapisywania plików AIFF i AIFF-C. Pliki AIFF są formatem plików wymiany audio (Audio Interchange File Format), formatem dla przechowywania cyfrowych próbek audio (dźwięku) w pliku. AIFF-C jest nowszą wersją formatu która zawiera możliwość kompresji danych audio.

source: Some operations may only work under IRIX; these will raise :exc:`ImportError` when attempting to import the :mod:`cl` module, which is only available on IRIX.
pl: Niektóre operacje mogą działać tylko pod IRIX; te zgłoszą wyjątek :exc:`ImportError` gdy nastąpi próba importowania modułu :mod:`cl`, który jest jedynie dostępny na IRIX.

source: Audio files have a number of parameters that describe the audio data. The sampling rate or frame rate is the number of times per second the sound is sampled. The number of channels indicate if the audio is mono, stereo, or quadro. Each frame consists of one sample per channel. The sample size is the size in bytes of each sample. Thus a frame consists of *nchannels*\**samplesize* bytes, and a second's worth of audio consists of *nchannels*\**samplesize*\**framerate* bytes.
pl: Pliki dźwiękowe ( - z ang. - audio files) mają pewną liczbę parametrów które opisują dane audio. Częstość próbkowania ( - z ang. - sampling rate) lub częstość ramek ( - z ang. - frame rate) jest liczbą chwil na sekundę w których dźwięk jest próbkowany. Liczba kanałów wskazuje czy dźwięk jest mono, stereo, czy quadro (jedno- dwu- lub cztero-kanałowy). Każda ramka składa się z jednej próbki na kanał. Rozmiar próbki jest rozmiarem w kęsach ( - z ang. - bytes) każdej próbki. Dlatego też ramka składa się z *nchannels*\**samplesize* bajtów (kęsów), zaś sekunda trwania dźwięku składa się z *nchannels*\**samplesize*\**framerate* bajtów (kęsów).

source: For example, CD quality audio has a sample size of two bytes (16 bits), uses two channels (stereo) and has a frame rate of 44,100 frames/second. This gives a frame size of 4 bytes (2\*2), and a second's worth occupies 2\*2\*44100 bytes (176,400 bytes).
pl: Dla przykładu, dźwięk jakości CD ma rozmiar próbki dwóch bajtów (16 bitów), używa dwóch kanałów (stereo) i ma rozmiar próbki 44,100 ramek/sekundę. To daje rozmiar ramki 4 bajtów (2\*2), i dźwięk długości jednej sekundy zajmuje 2\*2\*44100 bajtów (kęsów) (176,400 kęsów).

source: Module :mod:`aifc` defines the following function:
pl: Moduł :mod:`aifc` określa następujące zadania:

source: Open an AIFF or AIFF-C file and return an object instance with methods that are described below. The argument *file* is either a string naming a file or a file object. *mode* must be ``'r'`` or ``'rb'`` when the file must be opened for reading, or ``'w'`` or ``'wb'`` when the file must be opened for writing. If omitted, ``file.mode`` is used if it exists, otherwise ``'rb'`` is used. When used for writing, the file object should be seekable, unless you know ahead of time how many samples you are going to write in total and use :meth:`writeframesraw` and :meth:`setnframes`.
pl: Otwiera plik AIFF lub AIFF-C i zwraca przykład przedmiotu ze sposobami postępowania, które są opisane poniżej. Parametr *plik* ( - z ang - *file*) jest albo ciągiem znaków nazwy pliku lub przedmiotem samego pliku. *tryb* ( - z ang. - *mode*) musi być ``'r'`` lub ``'rb'`` gdy plik musi być otwarty do wczytania, lub ``'w'`` lub ``'wb'`` gdy plik musi być otwarty do zapisu. Jeśli pominięte, ``file.mode`` jest używane jeśli istnieje, w przeciwnym razie używane jest ``'rb'``. Gdy używane do zapisu, przedmiot pliku powinien być możliwy do przeszukania, chyba że wiesz z wyprzedzeniem czasu ile próbek masz zamiar zapisać w całości i użyjesz sposobów postępowania :meth:`writeframesraw` i :meth:`setnframes`.

source: Objects returned by :func:`.open` when a file is opened for reading have the following methods:
pl: Przedmioty zwrócone przez zadanie :func:`.open` gdy plik jest otwierany dla wczytywania, mają następujące sposoby postępowania:

source: Return the number of audio channels (1 for mono, 2 for stereo).
pl: Zwróć liczbę kanałów dźwięku (1 dla mono, 2 dla stereo).

source: Return the size in bytes of individual samples.
pl: Zwróć rozmiar w kęsach (bajtach) indywidualnych próbek.

source: Return the sampling rate (number of audio frames per second).
pl: Zwróć częstość próbkowania (liczbę ramek dźwięku na sekundę)

source: Return the number of audio frames in the file.
pl: Zwróć liczbę ramek dźwięku w pliku.

source: Return a bytes array of length 4 describing the type of compression used in the audio file. For AIFF files, the returned value is ``b'NONE'``.
pl: Zwróć tablicę bajtów o długości 4 określającą typ kompresji użytej w pliku dźwiękowym. Dla plików AIFF zwracana wartość jest ``b'NONE'``.

source: Return a bytes array convertible to a human-readable description of the type of compression used in the audio file. For AIFF files, the returned value is ``b'not compressed'``.
pl: Zwróć tablicę bajtów do zamiany w czytelny dla człowieka opis typu kompresji użytej w pliku dźwiękowym. Dla plików AIFF, zwracana wartość jest ``b'not compressed'`` ( - z ang. - nie skompresowane).

source: Return a tuple consisting of all of the above values in the above order.
pl: Zwróć krotkę składającą się ze wszystkich z powyższych wartości w powyższym porządku.

source: Return a list of markers in the audio file. A marker consists of a tuple of three elements. The first is the mark ID (an integer), the second is the mark position in frames from the beginning of the data (an integer), the third is the name of the mark (a string).
pl: Zwróć listę znaczników w pliku dźwiękowym. Znacznik składa się z krotki trzech elementów. Pierwszym jest ID znacznika (liczba całkowita), drugim jest pozycja znacznika w ramkach od początku danych (liczba całkowita), a trzecim jest nazwa znacznika (ciąg znaków).

source: Return the tuple as described in :meth:`getmarkers` for the mark with the given *id*.
pl: Zwróć krotkę, jak opisano w sposobie postępowania :meth:`getmarkers` dla znacznika o danym *id*.

source: Read and return the next *nframes* frames from the audio file. The returned data is a string containing for each frame the uncompressed samples of all channels.
pl: Wczytaj i zwróć następne *nramek* ramek z pliku dźwiękowego. Zwrócone dane są ciąg zawierający dla każdej ramki nieupakowane próbki ze wszystkich kanałów.

source: Rewind the read pointer. The next :meth:`readframes` will start from the beginning.
pl: Przewiń wskaźnik wczytywania. Następne wczytanie ramek :meth:`readframes` zacznie się od początku.

source: Seek to the specified frame number.
pl: Poszukaj ramki o określonym numerze.

source: Return the current frame number.
pl: Zwróć obecny numer ramki.

source: Close the AIFF file. After calling this method, the object can no longer be used.
pl: Zamknij plik AIFF. Po wezwaniu tego sposobu postępowania, przedmiot nie może być już więcej użyty.

source: Objects returned by :func:`.open` when a file is opened for writing have all the above methods, except for :meth:`readframes` and :meth:`setpos`. In addition the following methods exist. The :meth:`get\*` methods can only be called after the corresponding :meth:`set\*` methods have been called. Before the first :meth:`writeframes` or :meth:`writeframesraw`, all parameters except for the number of frames must be filled in.
pl: Przedmioty, zwracane przez zadanie :func:`.open`, gdy plik jest otwierany do pisania, mają wszystkie powyższe sposoby postępowania, z wyjątkiem sposobów postępowania :meth:`readframes` i :meth:`setpos`. W dodatku następujące sposoby postępowania istnieją. Sposób postępowania :meth:`get\*` może być wezwana tylko po tym jak zostanie wezwane odpowiadający mu sposób postępowania :meth:`set\*`. Przed pierwszym :meth:`writeframes` lub :meth:`writeframesraw`, wszystkie parametry oprócz liczby ramek muszą być wprowadzone.

source: Create an AIFF file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
pl: Utwórz plik AIFF. Domyślnie plik AIFF-C jest tworzony, chyba że nazwa pliku kończy się na ``'.aiff'`` w którym to przypadku domyślny jest plik AIFF.

source: Create an AIFF-C file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
pl: Utwórz plik AIFF-C. Domyślnie plik AIFF-C jest tworzony, chyba że nazwa pliku kończy się na ``'.aiff'`` w którym to przypadku domyślny jest plik AIFF.

source: Specify the number of channels in the audio file.
pl: Określ liczbę kanałów w pliku dźwiękowym.

source: Specify the size in bytes of audio samples.
pl: Określ rozmiar w kęsach (bajtach) ilości próbek dźwięku.

source: Specify the sampling frequency in frames per second.
pl: Określ częstotliwość próbkowania wyrażoną w ramkach na sekundę.

source: Specify the number of frames that are to be written to the audio file. If this parameter is not set, or not set correctly, the file needs to support seeking.
pl: Określ liczbę ramek które mają zostać zapisane do pliku dźwiękowego. Jeśli ten parametr nie jest ustawiony, lub ustawiony nieprawidłowo, plik powinien wspierać wyszukiwanie.

source: Specify the compression type. If not specified, the audio data will not be compressed. In AIFF files, compression is not possible. The name parameter should be a human-readable description of the compression type as a bytes array, the type parameter should be a bytes array of length 4. Currently the following compression types are supported: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.
pl: Określ typ upakowania danych. Jeśli nie określone dane dźwiękowe nie będą upakowane. W plikach AIFF, upakowanie nie jest możliwe. Parametr nazwy powinien być czytelnym dla człowieka opisem rodzaju upakowania jako tablica kęsów (bajtów), parametr rodzaju powinien być tabelą kęsów o długości 4. Obecnie następujące rodzaje kompresji są dostępne: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``,``b'G722'``.

source: Set all the above parameters at once. The argument is a tuple consisting of the various parameters. This means that it is possible to use the result of a :meth:`getparams` call as argument to :meth:`setparams`.
pl: Ustaw wszystkie powyższe parametry na raz. Parametr jest krotką składającą się z różnych parametrów. To oznacza że jest możliwe użycie wyniku sposobu postępowania :meth:`getparams` jako parametru dla sposobu postępowania :meth:`setparams`.

source: Add a mark with the given id (larger than 0), and the given name at the given position. This method can be called at any time before :meth:`close`.
pl: Dodaj znacznik o danym identyfikatorze (większym niż 0), i daną nazwą na danej pozycji. Ten sposób postępowania może być wywołany w dowolnym momencie przed wywołaniem :meth:`close`.

source: Return the current write position in the output file. Useful in combination with :meth:`setmark`.
pl: Zwróć obecne miejsce zapisu w pliku wynikowym. Użyteczne w kombinacji ze sposobem postępowania :meth:`setmark`.

source: Write data to the output file. This method can only be called after the audio file parameters have been set.
pl: Zapisz dane do wynikowego pliku. Ten sposób postępowania może być wywoływany tylko po tym jak parametry pliku dźwiękowego zostały ustawione.

source: Like :meth:`writeframes`, except that the header of the audio file is not updated.
pl: Podobnie do sposobu postępowania :meth:`writeframes`, z wyjątkiem tego że nagłówek pliku dźwiękowego nie jest uaktualniany.

source: Close the AIFF file. The header of the file is updated to reflect the actual size of the audio data. After calling this method, the object can no longer be used.
pl: Zapisz plik AIFF. Nagłówek pliku jest aktualizowany aby oddać aktualny rozmiar pliku dźwiękowego. Po wezwaniu tego sposobu postępowania, przedmiot nie może być więcej używany.

source: Generic Operating System Services
pl: Zastępcze Usługi Systemu Operacyjnego

source: The modules described in this chapter provide interfaces to operating system features that are available on (almost) all operating systems, such as files and a clock. The interfaces are generally modeled after the Unix or C interfaces, but they are available on most other systems as well. Here's an overview:
pl: Moduły opisane w tym rozdziale dostarczają sprzęgi dla własności systemu operacyjnego, które są dostępne w (prawie) wszystkich systemach operacyjnych, takich jak pliki i zegar. Sprzęgi są zwykle modelowane zgodnie ze sprzęgami Unix-a lub C, ale są one dostępne na większości innych systemów także. Tu jest przegląd:

source: Data Compression and Archiving
pl: Kompresja (upakowanie) Danych i Archiwizacja

source: The modules described in this chapter support data compression with the zlib, gzip, and bzip2 algorithms, and the creation of ZIP- and tar-format archives.
pl: Moduły opisane w tym rozdziale wspierają kompresję danych z algorytmami zlib, gzip, i bzip2, i kreacją archiwów w formacie ZIP- i tar-.

source: :mod:`argparse` -- Parser for command line options, arguments and sub-commands
pl: Moduł :mod:`argparse` -- Czytnik dla opcji linii poleceń, parametrów i podrzędnych poleceń.

source: The :mod:`argparse` module makes it easy to write user friendly command line interfaces. The program defines what arguments it requires, and :mod:`argparse` will figure out how to parse those out of :data:`sys.argv`. The :mod:`argparse` module also automatically generates help and usage messages and issues errors when users give the program invalid arguments.
pl: Moduł :mod:`argparse` czyni łatwym pisanie przyjaznych dla użytkownika sprzęgów linii poleceń. Program określa których parametrów wymaga, i :mod:`argparse` domyśli się jak wczytać te z :data:`sys.argv`. Moduł :mod:`argparse` także automatycznie generuje pomoc i wiadomości o użyciu i kieruje błędami gdy użytkownicy podadzą programowi nieprawidłowe parametry.

source: Example
pl: Przykład

source: The following code is a Python program that takes a list of integers and produces either the sum or the max::
pl: Następujący kod jest programem języka pytonowskiego, który pobiera listę liczb całkowitych i daje albo sumę albo maximum::

source: import argparse parser = argparse.ArgumentParser(description='Process some integers.') parser.add_argument('integers', metavar='N', type=int, nargs='+', help='an integer for the accumulator') parser.add_argument('--sum', dest='accumulate', action='store_const', const=sum, default=max, help='sum the integers (default: find the max)') args = parser.parse_args() print(args.accumulate(args.integers))
pl: import argparse parser = argparse.ArgumentParser(description='Przetwórz pewne liczby.') parser.add_argument('integers', metavar='N', type=int, nargs='+', help='liczba całkowita dla akumulatora') parser.add_argument('--sum', dest='skumuluj', action='store_const', const=sum, default=max, help='zsumuj liczby (domyślne: znajdź maximum)') args = parser.parse_args() print(args.accumulate(args.integers))

source: Assuming the Python code above is saved into a file called ``prog.py``, it can be run at the command line and provides useful help messages::
pl: Zakładając, że powyższy kod jest zapisany do pliku nazwanego ``prog.py``, może być uruchomiony w linii poleceń i dostarcza użytecznych wiadomości pomocowych

source: $ prog.py -h usage: prog.py [-h] [--sum] N [N ...] Process some integers. positional arguments: N an integer for the accumulator optional arguments: -h, --help show this help message and exit --sum sum the integers (default: find the max)
pl: $ prog.py -h użycie: prog.py [-h] [--sum] N [N ...] Przetwórz pewne liczby całkowite. Parametry pozycyjne: N liczba dla akumulatora opcjonalne parametry -h, --help pokaż tą wiadomość pomocy i wyjdź --sum sumuj liczby całkowite (domyślnie: znajdź maximum)

source: When run with the appropriate arguments, it prints either the sum or the max of the command-line integers::
pl: Gdy uruchomione z właściwymi parametrami, wypisuje albo sumę albo maksimum liczb całkowitych z wiersza poleceń::

source: If invalid arguments are passed in, it will issue an error::
pl: Jeśli nieprawidłowe parametry zostaną przekazane, wystosuje błąd::

source: $ prog.py a b c usage: prog.py [-h] [--sum] N [N ...] prog.py: error: argument N: invalid int value: 'a'
pl: $ prog.py a b c użycie: prog.py [-h] [--sum] N [N ...] prog.py: błąd: parametr N: niewłaściwa wartość liczby całkowitej: 'a'

source: The following sections walk you through this example.
pl: Następujące sekcje przeprowadzają cię przez ten przykład.

source: Creating a parser
pl: Tworzenie czytnika

source: The first step in using the :mod:`argparse` is creating an :class:`ArgumentParser` object::
pl: Pierwszym krokiem w użyciu modułu :mod:`argparse` jest utworzenie przedmiotu :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(description='Process some integers.')
pl: >>> parser = argparse.ArgumentParser(description='Przetwórz pewne liczby całkowite.')

source: The :class:`ArgumentParser` object will hold all the information necessary to parse the command line into python data types.
pl: Przedmiot :class:`ArgumentParser` przetrzyma wszystkie informacje konieczne do wczytania wiersza poleceń do typów danych języka pytonowskiego.

source: Adding arguments
pl: Dodawanie parametrów

source: Filling an :class:`ArgumentParser` with information about program arguments is done by making calls to the :meth:`~ArgumentParser.add_argument` method. Generally, these calls tell the :class:`ArgumentParser` how to take the strings on the command line and turn them into objects. This information is stored and used when :meth:`~ArgumentParser.parse_args` is called. For example::
pl: Wypełnienie uogólnienia :class:`ArgumentParser` za pomocą informacji o parametrach programu jest wykonywane przez wykonywanie odwołań do sposobu postępowania :meth:`~ArgumentParser.add_argument`. Ogólnie te wywołania mówią uogólnieniu :class:`ArgumentParser` jak wziąć ciągi z linii poleceń i zamienić je na przedmioty. Ta informacja jest przechowywana i używana gdy :meth:`~ArgumentParser.parse_args` jest wywoływane. Na przykład::
